return {
    tobot_scriptbot = 1, --启动脚本挂机--
    tobot_changemapscript = 0, --禁止根据地图名切换脚本--
    tobot_hit_range_right = 32, --设置左挂机范围32--
    tobot_hit_range_left = 99999,--设置右挂机范围99999--
    find_youhao = "滑板龙猫◆隐身怪;黑脸龙猫◆;魔法师的黑脸龙猫;杀黑脸龙猫的杀人陷阱;黑脸铁锤;被囚禁的木乃伊龙猫◆;魔法的物免图腾死亡奖励怪的闪电怪;小妖精的46秒计时怪;被控制的棕树伯伯;监测怪，攻击频率高;毒气怪;一团奇怪的光影;绿脸龙猫;穿梭光束;龙猫建筑师◆;魔法师的绿脸补血陷阱;魔法师的绿脸龙猫◆;黑脸龙猫◆;毒气模样;毒气的攻击怪;810006911;810006857;凶恶铁锤;黑脸龙猫◆;滑板龙猫◆隐身怪;滑板龙猫◆;810006858;沙滩龙猫◆;木乃伊龙猫◆;可封印的佛立特◆;隐藏地图隐身怪;沙滩龙猫◆;封之卡牌隐身怪;神秘卡牌;功能怪2技能召唤隐身怪;击杀功能怪3召唤隐身怪;小怪召唤隐身怪;火图腾，用火属性攻击更快哦BOSS战1;BOSS死后大炮;控制小妖精1的7怪;BOSS房闪电陷阱;??? 2Lv;810007493;810007495;810007494;减速隐身怪;击杀功能怪3召唤隐身怪;功能怪3技能召唤隐身怪;小怪召唤隐身怪;悲大玫瑰反弹隐身怪;玫瑰反弹隐身怪;好草反弹隐身怪;坏草反弹隐身怪;传送检测怪;好草;坏草;水之魂;土之魂;好魔女反弹隐身怪;坏魔女反弹隐身怪;纯洁的魔女之影;邪恶的魔女（半小时后死亡 请接任务后再杀我）;移动用怪物;萤火虫;BOSS死后终结小妖精怪;黑洞1;布拉斯亲卫队 ;魔力牛魔王;从右到左的火焰2;从左到右的火焰2;给玩家持续伤害的隐身怪;暂时无法攻击的仙草;毒气隐身怪;抑制仙草闪电;黑洞1;水晶矿场计时器;龙皇殿的机动枪兵队;??? 2Lv;杀死比弗罗斯特怪物;???? ????;Guardian;???;监测怪;隐藏的，可以束缚玩家的隐身怪物，5秒攻击一次，一次1人;无敌_SMG;阿修罗炮;DS-SL1;科隆;清除减速隐身怪;;秒杀隐身怪1;秒杀隐身怪2;传送迷失1隐身怪;传送迷失2隐身怪;传送迷失3隐身怪;传送迷失4隐身怪;减移动隐身怪;减跳跃隐身怪;减命中隐身怪;减MHP隐身怪;中毒隐身怪;传送迷失5隐身怪;叠1层迷失隐身怪;叠2层迷失隐身怪;叠3层迷失隐身怪;叠4层迷失隐身怪;叠5层迷失隐身怪;叠6层迷失隐身怪;传送理智5隐身怪;秒BOSS一阶隐身怪;疯狂的迷失感染者;被控制的棕树伯伯;一碰就炸的炸弹;跳板隐身怪;杂草;纽特攻击陷阱旋风（大）;水晶矿场计时器;???? ???;（绿）缸;（黄）缸;蓝池;BOSS死后传送怪;小门5;中门5;中门3;小门3;野蛮族杖手;BOSS死后大炮;BOSS房闪电陷阱;控制小妖精1的7怪;小妖精的46秒计时怪;监测怪，攻击频率高;毒气模样怪;毒气怪;开启副本的大猫;?? ???;特里尼雅亲卫队;龙猫妹妹2Lv;被诅咒的树;火焰攻击怪（召唤）;火焰怪物（召唤）;樱花鬼女;狐狸队长;蜜蜂;秒杀BOSS2假身隐身怪;为Boss1降防御隐身怪;毒雾;为Boss2降防御隐身怪;跳板隐身怪;火焰攻击怪;火焰怪物;减慢速度隐身怪;炸弹;???? ???;小怪召唤隐身怪;击杀功能怪3召唤隐身怪;龙猫妹妹;小师兄;初学门徒;小师妹;大师姐;师傅;师叔;DS-SL1;DS-G3648;DS-RG52;?? ???;纽特攻击陷阱旋风（大）;水晶矿场计时器;岐离 影刃;龙猫 3Lv;龙猫 6Lv;龙猫 5Lv;龙猫 4Lv;龙猫 2Lv;悲大玫瑰反弹隐身怪;玫瑰反弹隐身怪;???;欧若拉的宠物蚂蚁;????? ??;减防隐身怪;给玩家持续伤害的隐身怪;点燃我上天;隐身怪;湖水攻击怪（召唤）;湖水怪物（召唤）;成年的玫瑰;火把;永久为Boss1幻像加防御隐身怪;永久为Boss1减防御隐身怪;火焰攻击怪;火焰怪物;免疫功能怪4的秒杀buff隐身怪;击杀火焰墙隐身怪;击杀boss1幻想隐身怪;boss2真身召唤隐身怪;功能怪2死后召唤隐身怪;跳板;功能怪1召唤隐身怪;击杀功能怪3召唤隐身怪;小怪召唤隐身怪;神殿一阶召唤1;神殿阶段怪物;神殿一阶召唤3;神殿二阶召唤1;神殿二阶召唤4;神殿二阶召唤3;神殿二阶召唤2;神殿三阶召唤1;神殿三阶召唤6;神殿三阶召唤5;探险家成功召唤;神殿二阶召唤7;神殿二阶召唤6;神殿二阶召唤5;神殿三阶召唤2;神殿三阶召唤5;神殿一阶召唤2;神殿一阶召唤4;神殿一阶召唤5;神殿一阶召唤6;水晶矿洞计时器;神殿三阶召唤3;火元素;元素神谕者;水元素;光元素;秒杀隐身怪;消除秒杀隐身怪;清除秒杀隐身怪1;火把1;火把2;火把3;清除秒杀隐身怪2;清除减速隐身怪;??? ?? ??;纽尔德攻击陷阱小龙卷风;宝莱乌;秒杀隐身怪1;时空城门;击杀非法者;巨型龙猫俘虏;巨爪;~毒源~;杂草;杀死宝箱隐身怪;皇家大炮打击;点燃我上天;影刃 透明怪;毒气隐身怪;从左到右的火焰;红色蜡烛（左）;从右到左的火焰;红色蜡烛（右）;中间怪杀死小门隐身怪5;小门5;中门石头5;野蛮族飞镖手;中门持续召出的隐身怪5（中门5给石头怪打召唤祖拉尔的BUFF）;中门持续召出的隐身怪3（中门3给石头怪打召唤祖拉尔的BUFF）;引诱小门召一只野蛮族飞镖手头头;中门5;中门3;小门3;中间怪小门召唤怪5;引诱小门召一只野蛮人头头;中间怪小门召唤怪3;引诱小门召一只野蛮族杖手头头;绿池（小怪）;黄池（小怪）;野蛮族火把手;野蛮族杖手;野蛮人;祖拉尔中间怪 5S;杀死小门隐身怪5;中间怪小门5;蓝池（小怪）;中间怪杀死小门隐身怪3;中门石头3;传送检测怪;??????? ??? ??;（绿）缸;（黄）缸;BOSS死后传送怪;BOSS死后宝箱闪电怪;邪恶机甲;0;去除BOSS加成的温泉;火焰怪物（召唤）;跳板隐身怪;炸弹;减慢速度隐身怪;石元素;浣熊门徒;打更鹰;水蚊攻击怪物;水蚊障碍;",
    find_ewai = "资深魔法术士的徒弟;810045623;奖励宝箱;(30s)打死我获得悲;(30s)打死我获得喜;(30s)打死我获得好的;(30s)打死我获得坏的;达日曼;动心宝箱;召出火焰的机关;可使用机关;机关-传送门开启;机关-红〉粉;奇怪机关;810003539;火图腾，用火属性攻击更快哦;消灭我开始副本;机关-开启传送门;奖励宝箱2;奖励宝箱3;奖励宝箱1;奖励宝箱4;宝箱1;宝箱2;纯洁钥匙;宝箱;攻击我开始副本;时间怪物;奇怪机关;奖励宝箱;掉落喜字隐身怪;掉落悲字隐身怪;神殿时间怪物;竹偶;高级宝箱;开始副本竹偶怪;纯洁钥匙;纯净宝箱;",
    find_is_zhiding = 0,
    find_is_youhao = 1,
    find_is_ewai = 1,
    tobot_fastladder = 0,  --默认关闭快速爬梯，防止跳过头的情况
    tobot_jmporretn = 0, --碰墙自动转身
    ban_hit_mob = 0, -- 允许攻击
	tobot_hit_range_min = 0,
	tobot_hit_range_top = 100,
	tobot_hit_range_down = 20,
	tobot_hit_range_ignore = 900,
	tobot_script_x_distance = 50,
	tobot_script_y_distance = 20,
	find_showname=0,
	find_showhp=0,
	tobot_lingmingdu=10, --土拨鼠代玩模式
	tobot_giveitemtime=1, --宠物拾取速度1ms
}
